DataProcessors/фин_КонтрольКорректностиНастроекБюджетнойСтруктуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_КонтрольКорректностиНастроекБюджетнойСтруктуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СУчетомАктуальногоРегламента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Регламент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ранг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БюджетыСОбщимиФинансовымиПоказателями</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонкурирующийБюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяКонкурирующегоБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОшибкиВНастройкеФормул</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОшибкиВНастройкеЗависимостей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зависимость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.фин_НастройкаЗависимостейМеждуФинансовымиПоказателями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОшибкиВНастройкеМоделей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ПроизводственныеМодели</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_МоделиРаспределенияБюджетныхДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/фин_ПрименяемыеРегламентыФормированияБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ПрименяемыеРегламентыФормированияБюджетов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регламент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_БюджетныйРегламент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширенныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_РегламентФормированияБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_РегламентФормированияБюджетов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоЦентру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Регламент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_БюджетныйРегламент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_ЗависимостиФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ЗависимостиФинансовыхПоказателей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеИзмененияПоПериодам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПрофилиИзмененияПлановПоПериодам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДляРасчетаКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДляРасчетаСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитВлияющейСтатьиДляРасчетаКоличества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитВлияющейСтатьиДляРасчетаСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_НастройкиРасчетаЗависимостейБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйКоэффициентСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйКоэффициентКоличества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗависимаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимаяФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимыйНаборРазрезов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_НаборыРазрезовПоЗависимостям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользованиеЗависимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИспользованиеЗависимостейСтатейОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсходныйНаборРазрезов</Name>
					<Comment>Контрагент оборотов по влияющей статье</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_НаборыРазрезовПоЗависимостям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсхФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсхСценарий</Name>
					<Comment>Сценарий оборотов по влияющей статье</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_РасчетМоделейРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_РасчетМоделейРаспределения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименятьМодель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_МоделиРаспределенияБюджетныхДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РаспределяемыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_РасчетПроизводственныхМоделей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_РасчетПроизводственныхМоделей</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименятьМодель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПроизводственныеМодели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПоказательПланированияПроизводстваПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/фин_ВидыФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборотный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОстаточный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитываемый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/фин_КонтрольКорректностиНастроекБюджетнойСтруктуры/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("СУчетомАктуальногоРегламента",Объект.СУчетомАктуальногоРегламента);
	Если ЗначениеЗаполнено(Параметры.Адрес) Тогда
		ДанныеХранилища = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Для Каждого СтрокаТЧ Из ДанныеХранилища Цикл
			НоваяСтрока = Объект.Регламент.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЦикла;
		ЗаполнитьНаСервере();
	ИначеЕсли ЗначениеЗаполнено(Параметры.Регламент) Тогда
		АктуальныйРегламент = Параметры.Регламент;
		ЗаполнитьНаСервере();
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СУчетомАктуальногоРегламентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.ГруппаОшибкиВНастройкеЗависимостей.Видимость	= Объект.СУчетомАктуальногоРегламента;
	Элементы.ГруппаОшибкиВНастройкеМоделей.Видимость 		= Объект.СУчетомАктуальногоРегламента;
	Элементы.ГруппаОшибкиВНастройкеФормул.Видимость			= Объект.СУчетомАктуальногоРегламента;
	Элементы.АктуальныйРегламент.Видимость					= Объект.СУчетомАктуальногоРегламента;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.БюджетыСОбщимиФинансовымиПоказателями.Очистить();
	Объект.ОшибкиВНастройкеЗависимостей.Очистить();
	Объект.ОшибкиВНастройкеМоделей.Очистить();
	Объект.ОшибкиВНастройкеФормул.Очистить();
	Если НЕ ЗначениеЗаполнено(Параметры.Адрес) Тогда
		Объект.Регламент.Очистить();
		Если Объект.СУчетомАктуальногоРегламента Тогда
			
			Если НЕ ЗначениеЗаполнено(Параметры.Регламент) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	фин_ПрименяемыеРегламентыФормированияБюджетовСрезПоследних.Регламент,
					|	фин_ПрименяемыеРегламентыФормированияБюджетовСрезПоследних.РасширенныйРежим
					|ИЗ
					|	РегистрСведений.фин_ПрименяемыеРегламентыФормированияБюджетов.СрезПоследних(&Дата, ) КАК фин_ПрименяемыеРегламентыФормированияБюджетовСрезПоследних";
				
				Запрос.УстановитьПараметр("Дата", ТекущаяДата());
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					АктуальныйРегламент = ВыборкаДетальныеЗаписи.Регламент;
				КонецЕсли;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	фин_РегламентФормированияБюджетов.Бюджет,
			|	фин_РегламентФормированияБюджетов.Ранг
			|ИЗ
			|	РегистрСведений.фин_РегламентФормированияБюджетов КАК фин_РегламентФормированияБюджетов
			|ГДЕ
			|	фин_РегламентФормированияБюджетов.Регламент = &Регламент";
			
			Запрос.УстановитьПараметр("Регламент", АктуальныйРегламент);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаРегламент = РезультатЗапроса.Выбрать();
			Пока ВыборкаРегламент.Следующий() Цикл
				НоваяСтрока = Объект.Регламент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаРегламент);
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	// анализ конкурирующих статей бюджетов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиБюджета.Владелец КАК Бюджет,
		|	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	СтатьиБюджета.ФинансовыйПоказатель
		|ПОМЕСТИТЬ ВТ_СписокКонкурентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнализКоличества.ФинансовыйПоказатель КАК ФинансовыйПоказатель
		|	ИЗ
		|		(ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатьиБюджета.Ссылка) КАК КоличествоСтатейБюджета,
		|			СтатьиБюджета.ФинансовыйПоказатель КАК ФинансовыйПоказатель
		|		ИЗ
		|			Справочник.фин_СтатьиБюджета КАК СтатьиБюджета
		|		ГДЕ
		|			НЕ СтатьиБюджета.ПометкаУдаления
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СтатьиБюджета.ФинансовыйПоказатель) КАК АнализКоличества
		|	ГДЕ
		|		ЕСТЬNULL(АнализКоличества.КоличествоСтатейБюджета, 0) > 1) КАК СтатьиОборотов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_СтатьиБюджета КАК СтатьиБюджета
		|		ПО СтатьиОборотов.ФинансовыйПоказатель = СтатьиБюджета.ФинансовыйПоказатель
		|ГДЕ
		|	НЕ СтатьиБюджета.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокКонкурентов.Бюджет,
		|	ВТ_СписокКонкурентов.СтатьяБюджета,
		|	ВТ_СписокКонкурентов.ФинансовыйПоказатель,
		|	ВТ_СписокКонкурентов1.Бюджет КАК КонкурирующийБюджет,
		|	ВТ_СписокКонкурентов1.СтатьяБюджета КАК СтатьяКонкурирующегоБюджета
		|ИЗ
		|	ВТ_СписокКонкурентов КАК ВТ_СписокКонкурентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокКонкурентов КАК ВТ_СписокКонкурентов1
		|		ПО ВТ_СписокКонкурентов.ФинансовыйПоказатель = ВТ_СписокКонкурентов1.ФинансовыйПоказатель
		|			И ВТ_СписокКонкурентов.СтатьяБюджета <> ВТ_СписокКонкурентов1.СтатьяБюджета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Объект.СУчетомАктуальногоРегламента Тогда
			Ранг1 = 0;
			Ранг2 = 0;
			СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.Бюджет));
			Если СтрокиРегламент.Количество()=0 Тогда
				Продолжить;
			Иначе
				Ранг1 = СтрокиРегламент[0].Ранг;
			КонецЕсли;
			СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.КонкурирующийБюджет));
			Если СтрокиРегламент.Количество()=0 Тогда
				Продолжить;
			Иначе
				Ранг2 = СтрокиРегламент[0].Ранг;
			КонецЕсли;
			Если Ранг1 <> Ранг2 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока = Объект.БюджетыСОбщимиФинансовымиПоказателями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	// анализ конфликтов в формулах
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_СтатьиБюджета.Владелец КАК Бюджет,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.ФинансовыйПоказатель
		|ПОМЕСТИТЬ ВТ_Статьи
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|ГДЕ
		|	фин_СтатьиБюджета.Владелец В(&БюджетыПоРегламенту)
		|	И НЕ фин_СтатьиБюджета.ПометкаУдаления
		|	И фин_СтатьиБюджета.ФинансовыйПоказатель.ВидПоказателя = &ВидПоказателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Статьи.Бюджет,
		|	ВТ_Статьи.СтатьяБюджета,
		|	ВТ_Статьи.ФинансовыйПоказатель,
		|	фин_ФинансовыеПоказатели.ФормулаКоличество КАК Формула
		|ИЗ
		|	ВТ_Статьи КАК ВТ_Статьи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_ФинансовыеПоказатели КАК фин_ФинансовыеПоказатели
		|		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ФинансовыеПоказатели.Ссылка
		|ГДЕ
		|	фин_ФинансовыеПоказатели.УчетПоКоличеству
		|	И фин_ФинансовыеПоказатели.ФормулаКоличество <> &ПустаяФормула
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Статьи.Бюджет,
		|	ВТ_Статьи.СтатьяБюджета,
		|	ВТ_Статьи.ФинансовыйПоказатель,
		|	фин_ФинансовыеПоказатели.Формула
		|ИЗ
		|	ВТ_Статьи КАК ВТ_Статьи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_ФинансовыеПоказатели КАК фин_ФинансовыеПоказатели
		|		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ФинансовыеПоказатели.Ссылка
		|ГДЕ
		|	фин_ФинансовыеПоказатели.УчетПоСумме
		|	И фин_ФинансовыеПоказатели.Формула <> &ПустаяФормула
		|	И НЕ(фин_ФинансовыеПоказатели.УчетПоКоличеству
		|				И фин_ФинансовыеПоказатели.ФормулаКоличество <> &ПустаяФормула
		|				И фин_ФинансовыеПоказатели.ПоРасценкам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиФормул.Показатель,
		|	ПоказателиФормул.Ссылка КАК Формула,
		|	ПоказателиФормул.ВидПоказателя
		|ИЗ
		|	Справочник.фин_ФормулыРасчетаФинансовыхПоказателей.ВходящиеПоказатели КАК ПоказателиФормул
		|ГДЕ
		|	ПоказателиФормул.ВидПоказателя <> &ВидПоказателяРасчетный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	фин_СтатьиБюджета.ФинансовыйПоказатель,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.Владелец КАК Бюджет
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|ГДЕ
		|	НЕ фин_СтатьиБюджета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидПоказателя", Перечисления.фин_ВидыФинансовыхПоказателей.Рассчитываемый);
	Запрос.УстановитьПараметр("ВидПоказателяРасчетный", Перечисления.фин_ВидыПоказателейФормулРасчетаФинансовыхПоказателей.РасчетныйПоказатель);
	Запрос.УстановитьПараметр("ПустаяФормула", Справочники.фин_ФормулыРасчетаФинансовыхПоказателей.ПустаяСсылка());
	СписокБюджетовРегламента = Объект.Регламент.Выгрузить().ВыгрузитьКолонку("Бюджет");
	Запрос.УстановитьПараметр("БюджетыПоРегламенту",СписокБюджетовРегламента);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса[1].Выбрать();
	ПоказателиФормул 		= РезультатЗапроса[2].Выгрузить();
	ВсеПоказатели 			= РезультатЗапроса[3].Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РангТекущего = 0;
		СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.Бюджет));
		Если СтрокиРегламент.Количество()=0 Тогда
			Продолжить;
		Иначе
			РангТекущего = СтрокиРегламент[0].Ранг;
		КонецЕсли;
		Ошибки = "";
		ПоказателиФормулы = ПоказателиФормул.НайтиСтроки(Новый Структура("Формула",ВыборкаДетальныеЗаписи.Формула));
		Для Каждого СтрокаПоказатель Из ПоказателиФормулы Цикл
			Если СтрокаПоказатель.ВидПоказателя = Перечисления.фин_ВидыПоказателейФормулРасчетаФинансовыхПоказателей.СтатьиБюджета Тогда
				РангИсточника = 0;
				Если СтрокаПоказатель.Показатель = ВыборкаДетальныеЗаписи.Бюджет Тогда
					Продолжить;
				КонецЕсли;
				СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",СтрокаПоказатель.Показатель));
				Если СтрокиРегламент.Количество()=0 Тогда
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый бюджет """+СтрокаПоказатель.Показатель+""" отсутствует в текущем регламенте";
				Иначе
					РангИсточника = СтрокиРегламент[0].Ранг;
					Если РангИсточника>=РангТекущего Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый бюджет """+СтрокаПоказатель.Показатель+""" формируется по регламенту позже или одновременно с текущим. Во избежание ошибок он должен формировать раньше текущего";
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаПоказатель.ВидПоказателя = Перечисления.фин_ВидыПоказателейФормулРасчетаФинансовыхПоказателей.ГруппаСтатейБюджета Тогда
				БюджетГруппы = СтрокаПоказатель.Показатель.Владелец;
				Если БюджетГруппы = ВыборкаДетальныеЗаписи.Бюджет Тогда
					Продолжить;
				КонецЕсли;
				РангИсточника = 0;
				СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетГруппы));
				Если СтрокиРегламент.Количество()=0 Тогда
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемая группа статей """+СтрокаПоказатель.Показатель+""" принадлежит бюджету """+БюджетГруппы+""", который отсутствует в текущем регламенте";
				Иначе
					РангИсточника = СтрокиРегламент[0].Ранг;
					Если РангИсточника>=РангТекущего Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемая группа статей """+СтрокаПоказатель.Показатель+""" принадлежит бюджету """+БюджетГруппы+""", который формируется по регламенту позже или одновременно с текущим. Во избежание ошибок он должен формировать раньше текущего";
					КонецЕсли;
				КонецЕсли;
			Иначе
				ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",СтрокаПоказатель.Показатель));
				Если ИспользованиеПоказателя.Количество()=0 Тогда
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
				Иначе
					ЕстьИсточникиВнеРегламента = Ложь;
					ИсточникиВнеРегламента = Новый Массив;
					ИсточникиПозжеПоРегламенту = Новый Массив;
					НайденПодходящийВариант = Ложь;
					Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
						БюджетИсточник = СтрокаИспользования.Бюджет;
						Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
							НайденПодходящийВариант = Истина;
							Продолжить;
						КонецЕсли;
						РангИсточника = 0;
						СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
						Если СтрокиРегламент.Количество()=0 Тогда
							ЕстьИсточникиВнеРегламента = Истина;
							ИсточникиВнеРегламента.Добавить(БюджетИсточник);
						Иначе
							РангИсточника = СтрокиРегламент[0].Ранг;
							Если РангИсточника>=РангТекущего Тогда
								ИсточникиПозжеПоРегламенту.Добавить(БюджетИсточник);
							Иначе
								НайденПодходящийВариант = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если Не НайденПодходящийВариант Тогда
						Если ИсточникиПозжеПоРегламенту.Количество()>0 Тогда
							Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые формируются по регламенту позже или одновременно с текущим. Во избежание ошибок они должны формироваться раньше текущего (";
							Для Каждого Бюджет Из ИсточникиПозжеПоРегламенту Цикл
								Ошибки = Ошибки+Бюджет+";";
							КонецЦикла;
							Ошибки = Ошибки+")";
						ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
							Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
							Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
								Ошибки = Ошибки+Бюджет+";";
							КонецЦикла;
							Ошибки = Ошибки+")";
						Иначе
							Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Ошибки<>"" Тогда
			НоваяСтрока = Объект.ОшибкиВНастройкеФормул.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			НоваяСтрока.ОписаниеОшибки = Ошибки;
		КонецЕсли;
	КонецЦикла;

	// анализ конфликтов в зависимостях
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Зависимости.ИсхФинансовыйПоказатель КАК ИсходныйФинансовыйПоказатель,
		|	Зависимости.ЗависимаяФинансовыйПоказатель КАК ФинансовыйПоказатель,
		|	Зависимости.Регистратор КАК Зависимость,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.Владелец КАК Бюджет
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.фин_ЗависимостиФинансовыхПоказателей.СрезПоследних КАК Зависимости
		|		ПО фин_СтатьиБюджета.ФинансовыйПоказатель = Зависимости.ЗависимаяФинансовыйПоказатель
		|ГДЕ
		|	(Зависимости.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ Зависимости.ДатаЗавершения > &ТекущаяДата)
		|	И НЕ фин_СтатьиБюджета.ПометкаУдаления
		|	И фин_СтатьиБюджета.Владелец В(&БюджетыРегламента)";
	
	Запрос.УстановитьПараметр("БюджетыРегламента", СписокБюджетовРегламента);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РангТекущего = 0;
		СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.Бюджет));
		Если СтрокиРегламент.Количество()=0 Тогда
			Продолжить;
		Иначе
			РангТекущего = СтрокиРегламент[0].Ранг;
		КонецЕсли;
		Ошибки = "";

		ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",ВыборкаДетальныеЗаписи.ИсходныйФинансовыйПоказатель));
		Если ИспользованиеПоказателя.Количество()=0 Тогда
			Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- влияющий показатель """+ВыборкаДетальныеЗаписи.ИсходныйФинансовыйПоказатель+""" не включен ни в один бюджет";
		Иначе
			ЕстьИсточникиВнеРегламента = Ложь;
			ИсточникиВнеРегламента = Новый Массив;
			ИсточникиПозжеПоРегламенту = Новый Массив;
			НайденПодходящийВариант = Ложь;
			Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
				БюджетИсточник = СтрокаИспользования.Бюджет;
				Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
					НайденПодходящийВариант = Истина;
					Продолжить;
				КонецЕсли;
				РангИсточника = 0;
				СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
				Если СтрокиРегламент.Количество()=0 Тогда
					ЕстьИсточникиВнеРегламента = Истина;
					ИсточникиВнеРегламента.Добавить(БюджетИсточник);
				Иначе
					РангИсточника = СтрокиРегламент[0].Ранг;
					Если РангИсточника>=РангТекущего Тогда
						ИсточникиПозжеПоРегламенту.Добавить(БюджетИсточник);
					Иначе
						НайденПодходящийВариант = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если Не НайденПодходящийВариант Тогда
				Если ИсточникиПозжеПоРегламенту.Количество()>0 Тогда
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- влияющий показатель """+ВыборкаДетальныеЗаписи.ИсходныйФинансовыйПоказатель+""" используется только в бюджетах, которые формируются по регламенту позже или одновременно с текущим. Во избежание ошибок они должны формироваться раньше текущего (";
					Для Каждого Бюджет Из ИсточникиПозжеПоРегламенту Цикл
						Ошибки = Ошибки+Бюджет+";";
					КонецЦикла;
					Ошибки = Ошибки+")";
				ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- влияющий показатель """+ВыборкаДетальныеЗаписи.ИсходныйФинансовыйПоказатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
					Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
						Ошибки = Ошибки+Бюджет+";";
					КонецЦикла;
					Ошибки = Ошибки+")";
				Иначе
					Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- влияющий показатель """+ВыборкаДетальныеЗаписи.ИсходныйФинансовыйПоказатель+""" не включен ни в один бюджет";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Ошибки<>"" Тогда
			НоваяСтрока = Объект.ОшибкиВНастройкеЗависимостей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			НоваяСтрока.ОписаниеОшибки = Ошибки;
		КонецЕсли;
	КонецЦикла;
	
	// анализ конфликтов в моделях распределения
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_СтатьиБюджета.ФинансовыйПоказатель,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.Владелец КАК Бюджет,
		|	фин_РасчетМоделейРаспределенияСрезПоследних.Модель
		|ПОМЕСТИТЬ ВТ_МоделиРаспределения
		|ИЗ
		|	РегистрСведений.фин_РасчетМоделейРаспределения.СрезПоследних КАК фин_РасчетМоделейРаспределенияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|		ПО фин_РасчетМоделейРаспределенияСрезПоследних.РаспределяемыйПоказатель = фин_СтатьиБюджета.ФинансовыйПоказатель
		|ГДЕ
		|	фин_РасчетМоделейРаспределенияСрезПоследних.ПрименятьМодель
		|	И НЕ фин_СтатьиБюджета.ПометкаУдаления
		|	И фин_СтатьиБюджета.Владелец В (&БюджетыРегламента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиРаспределения.ФинансовыйПоказатель,
		|	ВТ_МоделиРаспределения.СтатьяБюджета,
		|	ВТ_МоделиРаспределения.Бюджет,
		|	ВТ_МоделиРаспределения.Модель
		|ИЗ
		|	ВТ_МоделиРаспределения КАК ВТ_МоделиРаспределения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиРаспределения.Модель,
		|	БазаРаспределения.ФинансовыйПоказатель КАК Показатель
		|ИЗ
		|	Справочник.фин_МоделиРаспределенияБюджетныхДанных.БазаРаспределения КАК БазаРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МоделиРаспределения КАК ВТ_МоделиРаспределения
		|		ПО БазаРаспределения.Ссылка = ВТ_МоделиРаспределения.Модель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиРаспределения.Модель,
		|	ОтражениеРезультатов.ФинансовыйПоказатель КАК Показатель
		|ИЗ
		|	Справочник.фин_МоделиРаспределенияБюджетныхДанных.ОтражениеРезультатов КАК ОтражениеРезультатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МоделиРаспределения КАК ВТ_МоделиРаспределения
		|		ПО ОтражениеРезультатов.Ссылка = ВТ_МоделиРаспределения.Модель";
	
	Запрос.УстановитьПараметр("БюджетыРегламента", СписокБюджетовРегламента);
	
	РезультатЗапроса 		= Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса[1].Выбрать();
	
	ТаблицаБаза 			= РезультатЗапроса[2].Выгрузить();

	ТаблицаРезультат 		= РезультатЗапроса[3].Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РангТекущего = 0;
		СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.Бюджет));
		Если СтрокиРегламент.Количество()=0 Тогда
			Продолжить;
		Иначе
			РангТекущего = СтрокиРегламент[0].Ранг;
		КонецЕсли;
		Ошибки = "";
		ПоказателиБазы = ТаблицаБаза.НайтиСтроки(Новый Структура("Модель",ВыборкаДетальныеЗаписи.Модель));
		Для Каждого СтрокаПоказатель Из ПоказателиБазы Цикл
			ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",СтрокаПоказатель.Показатель));
			Если ИспользованиеПоказателя.Количество()=0 Тогда
				Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель базы распределения """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
			Иначе
				ЕстьИсточникиВнеРегламента = Ложь;
				ИсточникиВнеРегламента = Новый Массив;
				ИсточникиПозжеПоРегламенту = Новый Массив;
				НайденПодходящийВариант = Ложь;
				Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
					БюджетИсточник = СтрокаИспользования.Бюджет;
					Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
						НайденПодходящийВариант = Истина;
						Продолжить;
					КонецЕсли;
					РангИсточника = 0;
					СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
					Если СтрокиРегламент.Количество()=0 Тогда
						ЕстьИсточникиВнеРегламента = Истина;
						ИсточникиВнеРегламента.Добавить(БюджетИсточник);
					Иначе
						РангИсточника = СтрокиРегламент[0].Ранг;
						Если РангИсточника>=РангТекущего Тогда
							ИсточникиПозжеПоРегламенту.Добавить(БюджетИсточник);
						Иначе
							НайденПодходящийВариант = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если Не НайденПодходящийВариант Тогда
					Если ИсточникиПозжеПоРегламенту.Количество()>0 Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель базы распределения """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые формируются по регламенту позже или одновременно с текущим. Во избежание ошибок они должны формироваться раньше текущего (";
						Для Каждого Бюджет Из ИсточникиПозжеПоРегламенту Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель базы распределения """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
						Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					Иначе
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый показатель базы распределения """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПоказателиРезультатов = ТаблицаРезультат.НайтиСтроки(Новый Структура("Модель",ВыборкаДетальныеЗаписи.Модель));
		Для Каждого СтрокаПоказатель Из ПоказателиРезультатов Цикл
			ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",СтрокаПоказатель.Показатель));
			Если ИспользованиеПоказателя.Количество()=0 Тогда
				Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
			Иначе
				ЕстьИсточникиВнеРегламента = Ложь;
				ИсточникиВнеРегламента = Новый Массив;
				ИсточникиРаньшеПоРегламенту = Новый Массив;
				НайденПодходящийВариант = Ложь;
				Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
					БюджетИсточник = СтрокаИспользования.Бюджет;
					Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
						НайденПодходящийВариант = Истина;
						Продолжить;
					КонецЕсли;
					РангИсточника = 0;
					СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
					Если СтрокиРегламент.Количество()=0 Тогда
						ЕстьИсточникиВнеРегламента = Истина;
						ИсточникиВнеРегламента.Добавить(БюджетИсточник);
					Иначе
						РангИсточника = СтрокиРегламент[0].Ранг;
						Если РангИсточника<=РангТекущего Тогда
							ИсточникиРаньшеПоРегламенту.Добавить(БюджетИсточник);
						Иначе
							НайденПодходящийВариант = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если Не НайденПодходящийВариант Тогда
					Если ИсточникиРаньшеПоРегламенту.Количество()>0 Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые формируются по регламенту раньше текущего. Во избежание ошибок они должны формироваться позже текущего (";
						Для Каждого Бюджет Из ИсточникиРаньшеПоРегламенту Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
						Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					Иначе
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Ошибки<>"" Тогда
			НоваяСтрока = Объект.ОшибкиВНастройкеМоделей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			НоваяСтрока.ОписаниеОшибки = Ошибки;
		КонецЕсли;
	КонецЦикла;
	
	// анализ конфликтов в моделях производства
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_СтатьиБюджета.ФинансовыйПоказатель,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.Владелец КАК Бюджет,
		|	фин_РасчетПроизводственныхМоделей.Модель
		|ПОМЕСТИТЬ ВТ_МоделиПроизводства
		|ИЗ
		|	РегистрСведений.фин_РасчетПроизводственныхМоделей.СрезПоследних КАК фин_РасчетПроизводственныхМоделей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|		ПО фин_РасчетПроизводственныхМоделей.ПоказательПланированияПроизводстваПродукции = фин_СтатьиБюджета.ФинансовыйПоказатель
		|ГДЕ
		|	фин_РасчетПроизводственныхМоделей.ПрименятьМодель
		|	И НЕ фин_СтатьиБюджета.ПометкаУдаления
		|	И фин_СтатьиБюджета.Владелец В(&БюджетыРегламента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиПроизводства.ФинансовыйПоказатель,
		|	ВТ_МоделиПроизводства.СтатьяБюджета,
		|	ВТ_МоделиПроизводства.Бюджет,
		|	ВТ_МоделиПроизводства.Модель,
		|	ВТ_МоделиПроизводства.Модель.РассчитыватьПрямыеТрудовыеЗатраты КАК РассчитыватьПрямыеТрудовыеЗатраты,
		|	ВТ_МоделиПроизводства.Модель.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат КАК ФинансовыйПоказательДляОтраженияТрудовыхЗатрат
		|ИЗ
		|	ВТ_МоделиПроизводства КАК ВТ_МоделиПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиПроизводства.Модель,
		|	ОтражениеРезультатов.ЗначениеФинансовыйПоказатель КАК Показатель
		|ИЗ
		|	Справочник.фин_ПроизводственныеМодели.ОтражениеРезультатов КАК ОтражениеРезультатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МоделиПроизводства КАК ВТ_МоделиПроизводства
		|		ПО ОтражениеРезультатов.Ссылка = ВТ_МоделиПроизводства.Модель
		|ГДЕ ОтражениеРезультатов.ЗначениеФинансовыйПоказатель<>ЗНАЧЕНИЕ(Справочник.Фин_ФинансовыеПоказатели.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МоделиПроизводства.Модель,
		|	ДополнительныеЗатратыНаВыпуск.ФинансовыйПоказатель КАК Показатель
		|ИЗ
		|	Справочник.фин_ПроизводственныеМодели.ДополнительныеЗатратыНаВыпуск КАК ДополнительныеЗатратыНаВыпуск
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МоделиПроизводства КАК ВТ_МоделиПроизводства
		|		ПО ДополнительныеЗатратыНаВыпуск.Ссылка = ВТ_МоделиПроизводства.Модель";
	
	Запрос.УстановитьПараметр("БюджетыРегламента", СписокБюджетовРегламента);
	
	РезультатЗапроса 		= Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса[1].Выбрать();
	
	ТаблицаРезультат 		= РезультатЗапроса[2].Выгрузить();
	
	ТаблицаДополнительныеЗатраты= РезультатЗапроса[3].Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РангТекущего = 0;
		СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",ВыборкаДетальныеЗаписи.Бюджет));
		Если СтрокиРегламент.Количество()=0 Тогда
			Продолжить;
		Иначе
			РангТекущего = СтрокиРегламент[0].Ранг;
		КонецЕсли;
		Ошибки = "";
		ПоказателиРезультатов = ТаблицаРезультат.НайтиСтроки(Новый Структура("Модель",ВыборкаДетальныеЗаписи.Модель));
		Для Каждого СтрокаПоказатель Из ПоказателиРезультатов Цикл
			ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",СтрокаПоказатель.Показатель));
			Если ИспользованиеПоказателя.Количество()=0 Тогда
				Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
			Иначе
				ЕстьИсточникиВнеРегламента = Ложь;
				ИсточникиВнеРегламента = Новый Массив;
				ИсточникиРаньшеПоРегламенту = Новый Массив;
				НайденПодходящийВариант = Ложь;
				Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
					БюджетИсточник = СтрокаИспользования.Бюджет;
					Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
						НайденПодходящийВариант = Истина;
						Продолжить;
					КонецЕсли;
					РангИсточника = 0;
					СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
					Если СтрокиРегламент.Количество()=0 Тогда
						ЕстьИсточникиВнеРегламента = Истина;
						ИсточникиВнеРегламента.Добавить(БюджетИсточник);
					Иначе
						РангИсточника = СтрокиРегламент[0].Ранг;
						Если РангИсточника<=РангТекущего Тогда
							ИсточникиРаньшеПоРегламенту.Добавить(БюджетИсточник);
						Иначе
							НайденПодходящийВариант = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если Не НайденПодходящийВариант Тогда
					Если ИсточникиРаньшеПоРегламенту.Количество()>0 Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые формируются по регламенту раньше текущего. Во избежание ошибок они должны формироваться позже текущего (";
						Для Каждого Бюджет Из ИсточникиРаньшеПоРегламенту Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
						Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					Иначе
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения результатов показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПоказателиДопЗатрат = ТаблицаДополнительныеЗатраты.НайтиСтроки(Новый Структура("Модель",ВыборкаДетальныеЗаписи.Модель));
		Для Каждого СтрокаПоказатель Из ПоказателиДопЗатрат Цикл
			ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",СтрокаПоказатель.Показатель));
			Если ИспользованиеПоказателя.Количество()=0 Тогда
				Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения дополнительных затрат показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
			Иначе
				ЕстьИсточникиВнеРегламента = Ложь;
				ИсточникиВнеРегламента = Новый Массив;
				ИсточникиРаньшеПоРегламенту = Новый Массив;
				НайденПодходящийВариант = Ложь;
				Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
					БюджетИсточник = СтрокаИспользования.Бюджет;
					Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
						НайденПодходящийВариант = Истина;
						Продолжить;
					КонецЕсли;
					РангИсточника = 0;
					СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
					Если СтрокиРегламент.Количество()=0 Тогда
						ЕстьИсточникиВнеРегламента = Истина;
						ИсточникиВнеРегламента.Добавить(БюджетИсточник);
					Иначе
						РангИсточника = СтрокиРегламент[0].Ранг;
						Если РангИсточника<=РангТекущего Тогда
							ИсточникиРаньшеПоРегламенту.Добавить(БюджетИсточник);
						Иначе
							НайденПодходящийВариант = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если Не НайденПодходящийВариант Тогда
					Если ИсточникиРаньшеПоРегламенту.Количество()>0 Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения дополнительных затрат показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые формируются по регламенту раньше текущего. Во избежание ошибок они должны формироваться позже текущего (";
						Для Каждого Бюджет Из ИсточникиРаньшеПоРегламенту Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения дополнительных затрат показатель """+СтрокаПоказатель.Показатель+""" используется только в бюджетах, которые не включены в текущий регламент (";
						Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					Иначе
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения дополнительных затрат показатель """+СтрокаПоказатель.Показатель+""" не включен ни в один бюджет";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ВыборкаДетальныеЗаписи.РассчитыватьПрямыеТрудовыеЗатраты = Истина И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат) Тогда
			ИспользованиеПоказателя = ВсеПоказатели.НайтиСтроки(Новый Структура("ФинансовыйПоказатель",ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат));
			Если ИспользованиеПоказателя.Количество()=0 Тогда
				Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения прямых трудовых затрат показатель """+ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат+""" не включен ни в один бюджет";
			Иначе
				ЕстьИсточникиВнеРегламента = Ложь;
				ИсточникиВнеРегламента = Новый Массив;
				ИсточникиРаньшеПоРегламенту = Новый Массив;
				НайденПодходящийВариант = Ложь;
				Для Каждого СтрокаИспользования Из ИспользованиеПоказателя Цикл
					БюджетИсточник = СтрокаИспользования.Бюджет;
					Если БюджетИсточник = ВыборкаДетальныеЗаписи.Бюджет Тогда
						НайденПодходящийВариант = Истина;
						Продолжить;
					КонецЕсли;
					РангИсточника = 0;
					СтрокиРегламент = Объект.Регламент.НайтиСтроки(Новый Структура("Бюджет",БюджетИсточник));
					Если СтрокиРегламент.Количество()=0 Тогда
						ЕстьИсточникиВнеРегламента = Истина;
						ИсточникиВнеРегламента.Добавить(БюджетИсточник);
					Иначе
						РангИсточника = СтрокиРегламент[0].Ранг;
						Если РангИсточника<=РангТекущего Тогда
							ИсточникиРаньшеПоРегламенту.Добавить(БюджетИсточник);
						Иначе
							НайденПодходящийВариант = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если Не НайденПодходящийВариант Тогда
					Если ИсточникиРаньшеПоРегламенту.Количество()>0 Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения прямых трудовых затрат показатель """+ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат+""" используется только в бюджетах, которые формируются по регламенту раньше текущего. Во избежание ошибок они должны формироваться позже текущего (";
						Для Каждого Бюджет Из ИсточникиРаньшеПоРегламенту Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					ИначеЕсли ЕстьИсточникиВнеРегламента Тогда
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения прямых трудовых затрат показатель """+ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат+""" используется только в бюджетах, которые не включены в текущий регламент (";
						Для Каждого Бюджет Из ИсточникиВнеРегламента Цикл
							Ошибки = Ошибки+Бюджет+";";
						КонецЦикла;
						Ошибки = Ошибки+")";
					Иначе
						Ошибки = Ошибки+?(Ошибки="","",Символы.ПС)+"- используемый для отражения прямых трудовых затрат показатель """+ВыборкаДетальныеЗаписи.ФинансовыйПоказательДляОтраженияТрудовыхЗатрат+""" не включен ни в один бюджет";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Ошибки<>"" Тогда
			НоваяСтрока = Объект.ОшибкиВНастройкеМоделей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			НоваяСтрока.ОписаниеОшибки = Ошибки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
